[
    {
        "UserName": "Jana",
        "Gender": "female",
        "DateOfBirth": "1998-08-23",
        "KnownAs": "Jana",
        "Created": "2022-01-23",
        "LastActive": "2022-05-01",
        "Introduction": "I am a girl who will definitely not leave you indifferent! I appreciate honesty and loyalty in people! For me, honesty and loyalty are the key to all relationships! Live as if this day is your last, that's my credo! Do not be afraid to take the first step, because I am open to communication and new relationships! I believe that only love can make you truly happy! I am a serious girl who knows what love is and is ready to experience this feeling again! Maybe I am what you need? Every woman wants to feel female happiness and I am no exception! I am ready for new acquaintances and meetings!.\r\n",
        "LookingFor": "t is hard to consider an ideal man I look for because he doesn't exist. As I am a down to earth girl I am not looking here someone ideal, I just want a typical man whose heart is lonely and ready to be loved and love like mine. I want to find an honest man, reliable, with strong beliefs who is ready to please his lady and never betray.\r\n",
        "Interests": "Musics, Movies",
        "City": "Montreal",
        "Country": "Canada",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/women/49.jpg",
                "IsMain": true
            },
            {
                "Url": "https://randomuser.me/api/portraits/women/49.jpg",
                "IsMain": false
            },
            {
                "Url": "https://randomuser.me/api/portraits/women/49.jpg",
                "IsMain": false
            }

        ]
    },
    {
        "UserName": "Ava",
        "Gender": "female",
        "DateOfBirth": "1995-03-16",
        "KnownAs": "Ava",
        "Created": "2022-10-23",
        "LastActive": "2022-05-13",
        "Introduction": "I'm kind and tender, easy going and humorous, though I really know the meaning of the word “lady” and know how to behave with a real man. I have inner core and it's hard to break my will. I believe that there is always room for improvement and always apply this rule to myself. I always train my personality, like improve my inner and outter world, i do not like to stay on one place, i have a light inside that burns me every day!\r\n",
        "LookingFor": "My ideal partner is loving, sincere, caring and just kind man who knows how to keep a word and support it with actions. Just those ones who have serious intentions can succeed and create happy life together. Everyone can agree that appearence plays not the last part, but for me it is also important what is inside. I think that woman with a kind heart like me can bewitch a man with the same sincere and kind heart. Are you ready to be bewitched by me?\r\n",
        "Interests": "Reading books, Music and Concerts",
        "City": "Brussels",
        "Country": "Belgium",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/women/58.jpg",
                "IsMain": true
            },
            {
                "Url": "https://randomuser.me/api/portraits/women/58.jpg",
                "IsMain": false
            },
            {
                "Url": "https://randomuser.me/api/portraits/women/58.jpg",
                "IsMain": false
            }
        ]
    },
    {
        "UserName": "Aline",
        "Gender": "female",
        "DateOfBirth": "1998-01-31",
        "KnownAs": "Aline",
        "Created": "2022-03-27",
        "LastActive": "2022-05-04",
        "Introduction": "I think I'm at the perfect age for something serious, exciting and most important love! A lot of love is exactly what I am ready to give and take back! I always try to be positive and I love to laugh! I love doing sports and outdoor activities, so I never get bored! I'm new here - finding relationships is the highest priority right now.\r\n",
        "LookingFor": "The most important is a soul of a man and his internal core. My perfect man should be polite, kind and honest. I know that ideal people are not existed, but I believe, that one day I will meet my man to whom I will present my warm cuddling, joy and happiness. It’s necessary for me to be sure of the partner.\r\n",
        "Interests": "Museums & Art, Shopping, Dancing",
        "City": "San Francisco",
        "Country": "USA",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/women/19.jpg",
                "IsMain": true
            },
            {
                "Url": "https://randomuser.me/api/portraits/women/19.jpg",
                "IsMain": false
            },
            {
                "Url": "https://randomuser.me/api/portraits/women/19.jpg",
                "IsMain": false
            }

        ]
    },
    {
        "UserName": "Nannie",
        "Gender": "female",
        "DateOfBirth": "2002-06-13",
        "KnownAs": "Nannie",
        "Created": "2022-03-16",
        "LastActive": "2022-06-20",
        "Introduction": "Lyudmila , 36 Online I am that woman who feels confident both with makeup and natural look😜. I enjoy when all is natural, easy. I do not like to wear mask, to hide my state or emotions, as prefer to show real me.🌝 I believe, that people build contact and feeling, according tщ emotions they feel, being together, but not according by impression, they get from the look of each other. I work as a realtor.😎 First attempts to get this job were very difficult, I had problems with language and could not sell any apartment. But over time, I adapted and began to receive true pleasure from my profession. I am opened-minded, confident and easygoing, ready for adventures and opened for feelings.\r\n",
        "LookingFor": "My ideal man is a real man, first of all. It is a man, who will tell me when he has a bad mood and does not want to listen about my shopping or talks to friends. it is a man, who can agree to go with me to opera, even if he hates it, just to spend time together and to share moments, which are important for me. Ideal man is that, who understands that to make me happy he has to share my interests and show respect. As in good relations we all sometimes have to do things, which do not like a lot. Agree?\r\n",
        "Interests": "Fashion, Sports, Reading books, Travelling.",
        "City": "Oslo",
        "Country": "Norway",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/women/46.jpg",
                "IsMain": true
            },
            {
                "Url": "https://randomuser.me/api/portraits/women/46.jpg",
                "IsMain": false
            }

        ]
    },
    {
        "UserName": "Ada",
        "Gender": "female",
        "DateOfBirth": "1998-02-24",
        "KnownAs": "Ada",
        "Created": "2019-11-11",
        "LastActive": "2020-05-21",
        "Introduction": "It is never easy to talk about oneself, but I could start by saying that I am a self-confident woman, with a simple personality that appreciates the simple things in life, like going for a walk outdoors or just sitting and watching the sunset since that fascinates me and I find it a very romantic place 😍🥰 I can also say that despite the bad experiences of my past, I have known how to get ahead and I have always tried to give the best of me, although I know I am not a perfect woman and I have made mistakes like every human being, I always try to correct myself and improve every day. If you want to know more about me feel free to send me a message 😊\r\n",
        "LookingFor": "I think it is important for you to read When I say that I am looking for the right person a man who is not perfect, the one who has those details that fill the heart with pure happiness, a humble and very simple man, a man who is able to give his love. But I would like to know if you are looking for a woman like me?❤️\r\n",
        "Interests": "Cooking, Travelling",
        "City": "Madrid",
        "Country": "Spain",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/women/9.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Kidd",
        "Gender": "male",
        "DateOfBirth": "1992-08-31",
        "KnownAs": "Kidd",
        "Created": "2019-11-17",
        "LastActive": "2020-06-28",
        "Introduction": "Hello👋🏻Greetings of peace and love. I’m 55 year old, American man, very loving, caring and compassionate, strong and devoted to all that is good, true and beautiful. I would love to meet my kindred heart and life partner to live a wonderful and profound life together.\r\n",
        "LookingFor": "I dream to find embodiment of divine feminine. My ideal is strong and graceful woman, who longing for a real deep love, who wants to be the sweetest wife, mother and most courageous side kick in the battle for the victory of the light.\r\n",
        "Interests": "Meditation, Reading books, Musics and Concerts",
        "City": "California",
        "Country": "USA",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/men/63.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Barker",
        "Gender": "male",
        "DateOfBirth": "1996-07-11",
        "KnownAs": "Barker",
        "Created": "2020-06-14",
        "LastActive": "2020-05-31",
        "Introduction": "A man with a dream is a super human being! Every time I dreamed something, it always came true. It was either due to fate or to my determination. I am a doctor. This job brings not only money, but also something that satisfies me. Every client is important to me and I always do my best for each one. I consider the profession of doctor to be the most noble. I dream that one day I will meet the woman of my dreams, with whom we will pour spiced wine, sit by the window, and talk all night long. Before dawn she will hold me tightly in her arms and we will admire the beautiful views. My inner world is rich. I hope that you will have the desire to discover it for yourself. I often go in for sports, because I believe that health comes first. I like to spend my free time in nature. For delicious meat, funny jokes, family laughter and bright sun that warms.\r\n",
        "LookingFor": "Kindness, sincerity, tolerance - these qualities of character are very important to me. I want her to be honest. I appreciate that. True character traits, habits. I need your passion for life to add to mine. Honestly, I don't have any ideal. I am looking for a simple woman who can make me happy in this life. Who gives, who is willing to open his heart to me. If I feel her love I will make her world bright and colorful, believe me, I know how to do it. I want us to laugh and dream together, raise children, be best friends, lovers, support and understand each other. I hope you have the same desire.\r\n",
        "Interests": "Lying on the beach, Reading books, Sports.",
        "City": "Rio de Janeiro",
        "Country": "Brazil",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/men/35.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Henderson",
        "Gender": "male",
        "DateOfBirth": "1976-07-06",
        "KnownAs": "Henderson",
        "Created": "2020-01-01",
        "LastActive": "2020-06-11",
        "Introduction": "I have been famous among daddy lovers, and I will not disappoint you, if you are a fan of one.\r\n",
        "LookingFor": "Daddy's boys.\r\n",
        "Interests": "Fishing & Hunting, Biking.",
        "City": "Kyiv",
        "Country": "Ukraine",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/men/13.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Dennis",
        "Gender": "male",
        "DateOfBirth": "1999-12-22",
        "KnownAs": "Dennis",
        "Created": "2020-03-28",
        "LastActive": "2020-05-10",
        "Introduction": "I'm a fun and outgoing guy who likes creativity. I like getting acquainted and communicating with new people online. I like traveling to different places all around the world and I adore adventures. I have a positive attitude to life and I'm always optimistic and smile. :) My passion is cooking and especially I love pastry and making desserts. That's why I'm a cook.;) To show my lady that I'm a mature serious man - I'm ready to provide for us both.\r\n",
        "LookingFor": "I'm looking here for my soul mate on this site but wouldn't mind to meet a lot of new friends as well. I really appreciate fun, open-hearted people who are not afraid to be themselves and who like to live life to the fullest.;) Maybe it's you? Let's check it out.).\r\n",
        "Interests": "Cooking, Nature, Music & Concerts.",
        "City": "Paris",
        "Country": "France",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/men/51.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Cain",
        "Gender": "male",
        "DateOfBirth": "1998-05-13",
        "KnownAs": "Cain",
        "Created": "2020-01-28",
        "LastActive": "2020-05-13",
        "Introduction": "Sometimes little things can be so beautiful on their own that they don't have to be put together into a single puzzle. Imagine that there is a mosaic, magnificent both in its single state and in its disassembled state, with the pieces lying right underfoot🙃. I try to appreciate every minute of my life. I consider myself a confident, goal-oriented, cheerful guy. I work as a sales representative for a large company.😎 Every day I interact with different people and always try to be kind and polite. I do not know how to be angry, offended.I consider it wrong to waste such emotions, it is better to forgive everything and live happily. In my free time I like to ride horses or just relax. I like to travel and see magically beautiful places of our world. In each travel I remember that place which has surprised me most of all to return there again but already with favourite girlfriend. 🤩.\r\n",
        "LookingFor": "I want us to learn this world together and to rejoice every day as children in small fortunes in life and simple happiness. my woman is a smart woman who knows what is individuality and the price of her own opinion. I like it when a person has their own views and thoughts, and it doesn't matter if they coincide with mine, as long as the person thinks and acts in a way that is not stereotypical. I want a girl who loves her job, who will be passionate about something:-).\r\n",
        "Interests": "Travelling, Sports, Nature.",
        "City": "Lisbon",
        "Country": "Portugal",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/men/94.jpg",
                "IsMain": true
            }
        ]
    }
]

